In [117]:
import mod_sql as ms
import imp
imp.reload(ms)

In [118]:
test = ms.Database('localhost', 'root', '0630', 'ubion7' ,3306)

In [93]:
sql = """
    select
    *
    from
    user_info
"""

test.func_3(sql)

  user_id user_pass user_name   user_phone  user_gender
0    test      1111      test  01012345678            1
1   test2      1234     test2  01011112222            1
2   test3      1234     test3  01011118888            1
3   test4      2222     test4  01022229999            1
4   test5      5555     test5  01077779999            1
5   test6      6666     test6  01077777777            1
6   test7      7777     test7  01078879999            1

In [94]:
test.sql_close()

In [106]:
test2 = ms.Database('172.16.11.148', 'ubion', '1234', 'ubion7' ,3306) # 강사님꺼

In [107]:
sql = """
    select
    *
    from
    user_info
"""

test2.func_3(sql)

         user_id user_pass user_name    user_phone  user_gender
0        MR.CHAN      7777   tesdt12  0107377577d7            1
1          MR.no      9999    bbbccc   01012341234            1
2          sejin      0617     sejin   01088218821            2
3  Sexyyeongsang      9999     tsast     123213123            1
4         teddd3   12343d5   tesdt12  0107377577d7            1
5         test10      1223      test   01033338888            1
6       test1111      1234      test   01022222222            1
7      test11111      1234      test   01011111111            1
8         test99      1465    test99   01077777777            1

In [97]:
sql = """
    insert into
    user_info
    values
    (%s, %s, %s, %s, %s)
"""

values= ["sejin", "0617", "sejin", "01088218821" , 2]

test2.func_3(sql,values)

'Query OK'

In [99]:
test2.sql_close()

In [111]:
sql = """
    select
    Name, Phone
    from
    example
    where
    Gender = 'male'
"""

test.func_3(sql)

  Name          Phone
0    A  010-1234-5678
1    C  010-1234-5680
2    E  010-1234-5682
3    G  010-1234-5684
4    I  010-1234-5686

In [112]:
sql = """
    select
    `Name` as '이름',
    `Phone` as '휴대폰번호'
    from
    example
    where
    Gender = %s
    limit 3
"""
#컬럼에는 ``로 묶는게 좋다고 하심

values = ['female']
test.func_3(sql,values)

  이름          휴대폰번호
0  B  010-1234-5679
1  D  010-1234-5681
2  F  010-1234-5683

In [113]:
sql = """
    select
    `createDt` as '등록일시',
    `deathCnt` as '사망자',
    `decideCnt` as '감염자'
    from
    corona
"""

test.func_3(sql)

                        등록일시    사망자       감염자
0    2022-06-08 09:09:05.982  24305  18188200
1    2022-06-07 09:09:00.897  24299  18174842
2    2022-06-06 09:00:06.734  24279  18168670
3    2022-06-05 08:53:19.426  24258  18163648
4    2022-06-04 08:56:49.219  24238  18153814
..                       ...    ...       ...
815  2020-03-14 00:00:00.000     72      8086
816  2020-03-13 00:00:00.000     67      7979
817  2020-03-12 00:00:00.000     66      7869
818  2020-03-11 00:00:00.000     60      7755
819  2020-03-10 00:00:00.000     54      7513

[820 rows x 3 columns]

In [87]:
import pandas as pd

In [88]:
coro = pd.read_csv("../csv/csv/corona.csv")
coro

,Unnamed: 0,createDt,deathCnt,decideCnt,seq,stateDt,stateTime,updateDt,accExamCnt,accDefRate
0,0,2022-06-08 09:09:05.982,24305,18188200,904,20220608,00:00,NaN,NaN,NaN
1,1,2022-06-07 09:09:00.897,24299,18174842,903,20220607,00:00,2022-06-08 09:10:36.846,NaN,NaN
2,2,2022-06-06 09:00:06.734,24279,18168670,902,20220606,00:00,2022-06-08 09:10:50.441,NaN,NaN
3,3,2022-06-05 08:53:19.426,24258,18163648,901,20220605,00:00,2022-06-08 09:11:04.758,NaN,NaN
4,4,2022-06-04 08:56:49.219,24238,18153814,900,20220604,00:00,2022-06-08 09:11:26.303,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
815,815,2020-03-14 00:00:00.000,72,8086,55,20200314,00:00,2021-10-07 10:30:51.51,261335.0,3.318000
816,816,2020-03-13 00:00:00.000,67,7979,54,20200313,00:00,2021-10-07 10:30:51.51,248647.0,3.458499
817,817,2020-03-12 00:00:00.000,66,7869,53,20200312,00:00,2021-10-07 10:30:51.51,234998.0,3.621744
818,818,2020-03-11 00:00:00.000,60,7755,52,20200311,00:00,2021-10-07 10:30:51.51,222395.0,3.804175
819,819,2020-03-10 00:00:00.000,54,7513,51,20200310,00:00,2021-10-07 10:30:51.51,210144.0,3.919308

In [89]:
coro.columns

Index(['Unnamed: 0', 'createDt', 'deathCnt', 'decideCnt', 'seq', 'stateDt',
       'stateTime', 'updateDt', 'accExamCnt', 'accDefRate'],
      dtype='object')

In [90]:
coro.columns=['Unnamed: 0', '등록일시', '사망자', '감염자', 'seq', 'stateDt',
       'stateTime', 'updateDt', 'accExamCnt', 'accDefRate']
coro

,Unnamed: 0,등록일시,사망자,감염자,seq,stateDt,stateTime,updateDt,accExamCnt,accDefRate
0,0,2022-06-08 09:09:05.982,24305,18188200,904,20220608,00:00,NaN,NaN,NaN
1,1,2022-06-07 09:09:00.897,24299,18174842,903,20220607,00:00,2022-06-08 09:10:36.846,NaN,NaN
2,2,2022-06-06 09:00:06.734,24279,18168670,902,20220606,00:00,2022-06-08 09:10:50.441,NaN,NaN
3,3,2022-06-05 08:53:19.426,24258,18163648,901,20220605,00:00,2022-06-08 09:11:04.758,NaN,NaN
4,4,2022-06-04 08:56:49.219,24238,18153814,900,20220604,00:00,2022-06-08 09:11:26.303,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
815,815,2020-03-14 00:00:00.000,72,8086,55,20200314,00:00,2021-10-07 10:30:51.51,261335.0,3.318000
816,816,2020-03-13 00:00:00.000,67,7979,54,20200313,00:00,2021-10-07 10:30:51.51,248647.0,3.458499
817,817,2020-03-12 00:00:00.000,66,7869,53,20200312,00:00,2021-10-07 10:30:51.51,234998.0,3.621744
818,818,2020-03-11 00:00:00.000,60,7755,52,20200311,00:00,2021-10-07 10:30:51.51,222395.0,3.804175
819,819,2020-03-10 00:00:00.000,54,7513,51,20200310,00:00,2021-10-07 10:30:51.51,210144.0,3.919308

In [105]:
coro.drop(['Unnamed: 0','seq', 'stateDt',
       'stateTime', 'updateDt', 'accExamCnt', 'accDefRate'],axis=1,inplace=True)
coro

                        등록일시    사망자       감염자
0    2022-06-08 09:09:05.982  24305  18188200
1    2022-06-07 09:09:00.897  24299  18174842
2    2022-06-06 09:00:06.734  24279  18168670
3    2022-06-05 08:53:19.426  24258  18163648
4    2022-06-04 08:56:49.219  24238  18153814
..                       ...    ...       ...
815  2020-03-14 00:00:00.000     72      8086
816  2020-03-13 00:00:00.000     67      7979
817  2020-03-12 00:00:00.000     66      7869
818  2020-03-11 00:00:00.000     60      7755
819  2020-03-10 00:00:00.000     54      7513

[820 rows x 3 columns]

In [121]:
sql = """
    select
    `Country` as '국가',
    `Units Sold` as '판매개수',
    `Unit Price` as '가격',
    `Unit Cost` as '원가',
    (`Units Sold` * `Unit Price`) as '총수익',
    (`Units Sold` * `Unit Cost`) as '총비용',
    (`Units Sold` * `Unit Price` - `Units Sold` * `Unit Cost`) as '총이윤'
    from 
    `Sales Records`
"""

test.func_3(sql)

,국가,판매개수,가격,원가,총수익,총비용,총이윤
0,Chad,4484,651.21,524.96,2920025.64,2353920.64,566105.00
1,Latvia,1075,47.45,31.79,51008.75,34174.25,16834.50
2,Pakistan,6515,154.06,90.93,1003700.90,592408.95,411291.95
3,Democratic Republic of the Congo,7683,668.27,502.54,5134318.41,3861014.82,1273303.59
4,Czech Republic,3491,47.45,31.79,165647.95,110978.89,54669.06
...,...,...,...,...,...,...,...
9995,Laos,8597,47.45,31.79,407927.65,273298.63,134629.02
9996,Liechtenstein,562,437.20,263.33,245706.40,147991.46,97714.94
9997,Democratic Republic of the Congo,2524,154.06,90.93,388847.44,229507.32,159340.12
9998,South Africa,8706,421.89,364.69,3672974.34,3174991.14,497983.20
9999,Mongolia,361,152.58,97.44,55081.38,35175.84,19905.54